Revit 2027 API
LightFamily.GetLightTypeName Method
 Return the name for the light type at the given index
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetLightTypeName(
	int index
)
Public Function GetLightTypeName (
	index As Integer
) As String
public:
String^ GetLightTypeName(
	int index
)
member GetLightTypeName :
        index : int -> string
Parameters
index Int32
 The index of the light type
Return Value
String
 The name of the light type at the given index
Exceptions
Exception | Condition
ArgumentException |  The index is the argument that is being validated The index is not valid because it does not correspond to a valid light type
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace